{"keras_version": "1.1.0", "config": [{"config": {"border_mode": "valid", "name": "convolution2d_1", "nb_col": 3, "trainable": true, "b_regularizer": null, "W_constraint": null, "input_dtype": "float32", "nb_row": 3, "nb_filter": 32, "activation": "linear", "batch_input_shape": [null, 1, 28, 28], "init": "glorot_uniform", "W_regularizer": null, "subsample": [1, 1], "activity_regularizer": null, "b_constraint": null, "bias": true, "dim_ordering": "th"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "activation_1", "activation": "relu"}, "class_name": "Activation"}, {"config": {"border_mode": "valid", "name": "convolution2d_2", "nb_col": 3, "trainable": true, "b_regularizer": null, "W_constraint": null, "nb_row": 3, "nb_filter": 32, "activation": "linear", "init": "glorot_uniform", "W_regularizer": null, "subsample": [1, 1], "activity_regularizer": null, "b_constraint": null, "bias": true, "dim_ordering": "th"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "activation_2", "activation": "relu"}, "class_name": "Activation"}, {"config": {"pool_size": [2, 2], "trainable": true, "name": "maxpooling2d_1", "border_mode": "valid", "strides": [2, 2], "dim_ordering": "th"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "dropout_1", "p": 0.25}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"name": "dense_1", "trainable": true, "W_regularizer": null, "W_constraint": null, "output_dim": 128, "activation": "linear", "input_dim": null, "activity_regularizer": null, "b_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "bias": true}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_3", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "dropout_2", "p": 0.5}, "class_name": "Dropout"}, {"config": {"name": "dense_2", "trainable": true, "W_regularizer": null, "W_constraint": null, "output_dim": 10, "activation": "linear", "input_dim": null, "activity_regularizer": null, "b_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "bias": true}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_4", "activation": "softmax"}, "class_name": "Activation"}], "class_name": "Sequential"}